{
    "id": "sol/earth",
    "name": "Earth",
    "hook": "The only known world where oceans, atmosphere, and life coexist.",
    "type": "planet",
    "systemId": "sol",
    "navParentId": "sol",
    "navOrder": 3,
    "curationScore": 98,
    "highlights": [
        "Harbors a stable surface ocean covering approximately 71% of the planetary surface [1].",
        "Possesses an active tectonic plate system that drives global geochemical cycling and massive geologic resurfacing [2].",
        "Generates a robust global dipole magnetic field through a convective liquid iron alloy outer core [3].",
        "Maintains an atmosphere profoundly altered by biological processes, highly enriched in diatomic oxygen [1]."
    ],
    "howWeKnow": [
        "Extensive in-situ surface, atmospheric, and oceanic monitoring networks mapping global climate and chemical systems.",
        "Seismic wave propagation analysis mapping the boundaries, densities, and states of the inner core, outer core, and mantle.",
        "Satellite geodesy and remote sensing measuring gravity anomalies, topography, and surface deformation.",
        "Magnetometer arrays recording temporal and spatial variations in the geomagnetic field.",
        "Paleoclimatological and isotopic analysis of ice cores, geological strata, and ancient zircons."
    ],
    "openQuestions": [
        "How and precisely when did subduction and plate tectonics initiate in Earth's early history?",
        "What was the exact origin and delivery mechanism of Earth's massive surface water inventory?",
        "How do structural and thermal variations at the core-mantle boundary influence the frequency and duration of geomagnetic reversals?"
    ],
    "sources": [
        {
            "attribution": "NASA National Space Science Data Center",
            "title": "Earth Fact Sheet",
            "url": "[https://nssdc.gsfc.nasa.gov/planetary/factsheet/earthfact.html](https://nssdc.gsfc.nasa.gov/planetary/factsheet/earthfact.html)",
            "year": 2024,
            "publisher": "NASA/GSFC"
        },
        {
            "attribution": "Sleep, N. H.",
            "title": "Evolution of the Continental Lithosphere",
            "year": 2005,
            "publisher": "Annual Review of Earth and Planetary Sciences"
        },
        {
            "attribution": "Glatzmaier, G. A., et al.",
            "title": "The role of the Earth's mantle in controlling the frequency of geomagnetic reversals",
            "year": 1999,
            "publisher": "Nature"
        }
    ],
    "scientificSynthesis": [
        "Earth is currently the only known planetary body to harbor life, sustained by a complex interplay of a stable hydrosphere, a thick nitrogen-oxygen atmosphere, and active plate tectonics [1]. The continuous recycling of carbon and silicate rock driven by tectonic and volcanic activity acts as a long-term planetary thermostat, an extraordinary feature that regulates surface conditions over geologic timescales [2].",
        "Its strong, intrinsic global magnetic field, generated by a geodynamo within the convective liquid outer core, shields the surface from severe solar and cosmic radiation, preventing the rapid stripping of the atmosphere by solar wind [3].",
        "A major scientific surprise in planetary sciences was the extent to which the Earth's atmosphere and surface chemistry have been radically altered by biological processes over billions of years, creating a highly reactive oxygen-rich environment that is thermodynamically unstable [1]."
    ],
    "physical": {
        "meanRadiusKm": 6371,
        "massKg": 5.9724e+24,
        "densityKgM3": 5514,
        "surfaceGravityMS2": 9.8,
        "escapeVelocityMS": 11190
    },
    "orbit": {
        "semiMajorAxisKm": 149598023,
        "orbitalPeriodDays": 365.256,
        "eccentricity": 0.0167,
        "inclinationDeg": 0.00005,
        "rotationPeriodHours": 23.9345,
        "retrogradeRotation": false,
        "tidallyLocked": false
    },
    "composition": {
        "primary": [
            "iron",
            "oxygen",
            "silicon",
            "magnesium",
            "sulfur"
        ],
        "atmosphere": {
            "type": "thick",
            "mainComponents": [
                "nitrogen",
                "oxygen",
                "argon",
                "water vapor",
                "carbon dioxide"
            ],
            "surfacePressureBar": 1.014
        },
        "internalStructure": [
            "solid inner iron core",
            "liquid outer iron core",
            "silicate mantle",
            "silicate crust"
        ]
    },
    "environment": {
        "meanTemperatureK": 288,
        "minTemperatureK": 184,
        "maxTemperatureK": 331,
        "liquidWaterPresence": "surface",
        "magneticFieldType": "global",
        "volcanicActivity": "confirmed",
        "cryovolcanicActivity": "none",
        "tectonicActivity": "confirmed"
    },
    "discovery": {
        "discoveryYearPrecision": "prehistoric"
    }
}
