{
    "id": "sol/jupiter/io",
    "name": "Io",
    "hook": "The most volcanically active body in the solar system, featuring lava fountains that can reach dozens of kilometers high and massive calderas [2].",
    "type": "moon",
    "size": 3,
    "systemId": "sol",
    "navParentId": "sol/jupiter",
    "navOrder": 1,
    "curationScore": 92,
    "physical": {
        "meanRadiusKm": 1821.6,
        "massKg": 8.9319e22,
        "densityKgM3": 3527.5,
        "surfaceGravityMS2": 1.796,
        "escapeVelocityMS": 2558
    },
    "orbit": {
        "semiMajorAxisKm": 421700,
        "orbitalPeriodDays": 1.769138,
        "eccentricity": 0.0041,
        "inclinationDeg": 0.05,
        "rotationPeriodHours": 42.459312,
        "retrogradeRotation": false,
        "tidallyLocked": true
    },
    "composition": {
        "primary": ["Silicate rock", "Iron", "Sulfur"],
        "atmosphere": {
            "type": "tenuous",
            "mainComponents": ["Sulfur dioxide"],
            "surfacePressureBar": 1e-9
        },
        "internalStructure": [
            "Iron or iron-sulfide core",
            "Silicate mantle",
            "Subsurface magma ocean",
            "Silicate and sulfur-rich crust"
        ]
    },
    "environment": {
        "meanTemperatureK": 130,
        "liquidWaterPresence": "none",
        "magneticFieldType": "induced",
        "volcanicActivity": "confirmed",
        "cryovolcanicActivity": "none",
        "tectonicActivity": "confirmed"
    },
    "discovery": {
        "discoveredBy": "Galileo Galilei",
        "discoveryYear": 1610,
        "discoveryYearPrecision": "exact",
        "discoveryMethod": "Telescopic observation"
    },
    "scientificSynthesis": [
        "Io stands out as the most geologically active body in the solar system, characterized by hundreds of active silicate volcanoes and extensive, continuous lava flows. This extreme volcanism is not powered by internal radioactive decay, but by immense tidal heating. Caught in a 4:2:1 Laplace orbital resonance with Europa and Ganymede, Io's interior is subjected to relentless gravitational flexing from Jupiter and its fellow moons, generating extreme frictional heat that melts its subsurface rock and drives endless eruptions [1].",
        "The moon's activity extends far beyond its surface to profoundly influence the entire Jovian system. Sulfur and oxygen escaping from Io's weak gravity are ionized and swept up by Jupiter's rapidly rotating magnetic field. This process forms the massive Io plasma torus and generates a powerful, multi-million-ampere electrical flux tube that links the moon directly to Jupiter's polar atmosphere, triggering intense, permanent auroral displays [2].",
        "Measurements of Jupiter's magnetic field near Io suggest the presence of a strong induced magnetic signature, which scientists interpret as evidence for a global, electrically conductive magma ocean located beneath the moon's solid lithosphere. Understanding Io's interior structure, extreme heat flow, and tectonic mountain-building provides critical insights into the geophysical processes that likely shaped the early, violently active terrestrial planets [3]."
    ],
    "highlights": [
        "The most volcanically active body in the solar system, featuring lava fountains that can reach dozens of kilometers high and massive calderas [2].",
        "Generates extreme internal heat through tidal friction caused by its orbital resonance with Jupiter, Europa, and Ganymede [1].",
        "Loses approximately one ton of sulfur and oxygen per second, providing the primary source of plasma for Jupiter's massive magnetosphere [2].",
        "Features extreme tectonic activity, with crustal compression building block-faulted mountains up to 17 kilometers tall, despite having no tectonic plates [3]."
    ],
    "howWeKnow": [
        "The Voyager 1 and 2 probes provided the first definitive proof of active volcanism by capturing images of massive plumes erupting from the surface.",
        "The Galileo spacecraft completed multiple close flybys, mapping surface mineralogy, measuring thermal output, and detecting magnetic perturbations indicative of an induced field.",
        "The Juno mission continuously monitors Io's polar regions in high-resolution infrared, mapping the distribution and temperature of hundreds of active volcanic hotspots.",
        "Ground-based telescopes continuously track the temporal variability of its volcanic outbursts, atmospheric density, and the state of the surrounding plasma torus."
    ],
    "openQuestions": [
        "Is the subsurface magma ocean a continuous, global layer, or is the magma concentrated in interconnected regional pockets?",
        "How long has the Laplace orbital resonance been stable, and has Io maintained this extreme level of volcanic activity throughout its entire history?",
        "What is the exact composition of the highest-temperature lavas, and do they indicate an ultramafic composition similar to the ancient lavas of early Earth?",
        "How does the thick, cold lithosphere support massive tectonic mountains while simultaneously allowing such immense volcanic heat flux to escape?"
    ],
    "sources": [
        {
            "attribution": "NASA Space Science Data Coordinated Archive (NSSDCA)",
            "title": "Jovian Satellite Fact Sheet",
            "url": "https://nssdc.gsfc.nasa.gov/planetary/factsheet/joviansatfact.html"
        },
        {
            "attribution": "NASA Jet Propulsion Laboratory",
            "title": "Io: In Depth",
            "url": "https://solarsystem.nasa.gov/moons/jupiter-moons/io/in-depth/"
        },
        {
            "attribution": "Khurana, K. K., et al.",
            "title": "Evidence of a Global Magma Ocean in Io's Interior",
            "year": 2011,
            "publisher": "Science"
        }
    ]
}
