{
    "id": "sol/uranus",
    "name": "Uranus",
    "hook": "An ice giant tipped sideways, rotating like a world rolling around the Sun.",
    "type": "planet",
    "size": 7,
    "systemId": "sol",
    "navParentId": "sol/sun",
    "navOrder": 8,
    "curationScore": 84,
    "highlights": [
        "Uranus rotates on its side with an axial tilt of 97.77 degrees, likely the consequence of a massive collision early in the solar system's history [2].",
        "The planet possesses a highly irregular magnetic field, tilted 59 degrees from its rotational axis and generated by convective currents in its fluid mantle [3].",
        "It features the coldest planetary atmosphere in the solar system, with tropopause temperatures dropping as low as 49 K despite being closer to the Sun than Neptune [1].",
        "The distinctive cyan-blue coloration of Uranus is primarily caused by methane gas in its upper atmosphere absorbing red light from the Sun [2]."
    ],
    "howWeKnow": [
        "The Voyager 2 spacecraft provided the only direct, close-up observations of the Uranian system during its 1986 flyby, measuring magnetic fields, discovering moons, and mapping the rings.",
        "Earth-based observatories, including the Keck Observatory, and space-based telescopes like Hubble and the James Webb Space Telescope continually monitor atmospheric dynamics, ring properties, and seasonal changes.",
        "Radio occultation and spectroscopy are utilized to determine atmospheric composition, density, and temperature profiles."
    ],
    "openQuestions": [
        "What exact mechanism or event caused the extreme 97.77-degree axial tilt of Uranus, and how did its moons and rings form or survive during this disruption?",
        "Why does Uranus radiate significantly less internal heat than the other giant planets in the solar system?",
        "How is the highly asymmetric and offset magnetic field generated within the planet's interior?",
        "Is the 'icy' mantle fully mixed, or does the interior possess distinct compositional layers?"
    ],
    "sources": [
        {
            "attribution": "NASA Space Science Data Coordinated Archive",
            "title": "Uranus Fact Sheet",
            "url": "[https://nssdc.gsfc.nasa.gov/planetary/factsheet/uranusfact.html](https://nssdc.gsfc.nasa.gov/planetary/factsheet/uranusfact.html)",
            "year": 2024,
            "publisher": "NASA"
        },
        {
            "attribution": "NASA Solar System Exploration",
            "title": "Uranus: In Depth",
            "url": "[https://science.nasa.gov/uranus/facts/](https://science.nasa.gov/uranus/facts/)",
            "year": 2024,
            "publisher": "NASA"
        },
        {
            "attribution": "Smith, B. A., et al.",
            "title": "Voyager 2 in the Uranian System: Imaging Science Results",
            "year": 1986,
            "publisher": "Science"
        }
    ],
    "scientificSynthesis": [
        "Uranus is the seventh planet from the Sun and holds the distinction of being the first planet discovered with the aid of a telescope [2]. It is classified as an ice giant, meaning its bulk composition is dominated by elements heavier than hydrogen and helium, specifically ices of water, ammonia, and methane in a supercritical fluid state [1]. Its most extraordinary feature is an extreme axial tilt of 97.77 degrees, causing the planet to rotate virtually on its side and driving dramatic, decades-long seasonal changes throughout its 84-year orbit [2].",
        "The 1986 flyby of NASA's Voyager 2 spacecraft radically transformed scientific understanding of the Uranian system [3]. Among its most surprising discoveries was a highly unusual magnetic field that is strongly asymmetric, tilted by 59 degrees from the planet's axis of rotation, and significantly offset from its geometric center [3]. The mission also revealed 10 new moons, two additional rings, and confirmed that the planet's upper atmosphere is dynamically active, contrary to its visually featureless appearance in visible light [2].",
        "Unlike the other giant planets, Uranus exhibits extremely low internal heat generation, emitting scarcely any more thermal energy than it receives from the Sun [1]. The mechanisms behind this sluggish heat release and its dramatic axial tilt—often hypothesized to be the result of a colossal protoplanetary impact—remain central mysteries in planetary science [2]. Studying Uranus is increasingly critical, as the majority of exoplanets discovered to date fall into a similar size and mass regime as the solar system's ice giants [2]."
    ],
    "physical": {
        "meanRadiusKm": 25362,
        "massKg": 8.6813e25,
        "densityKgM3": 1270,
        "surfaceGravityMS2": 8.69,
        "escapeVelocityMS": 21300
    },
    "orbit": {
        "semiMajorAxisKm": 2870658000,
        "orbitalPeriodDays": 30685.4,
        "eccentricity": 0.0457,
        "inclinationDeg": 0.772,
        "rotationPeriodHours": 17.24,
        "retrogradeRotation": true,
        "tidallyLocked": false
    },
    "composition": {
        "primary": [
            "water ice",
            "ammonia ice",
            "methane ice",
            "hydrogen",
            "helium",
            "silicate rock"
        ],
        "atmosphere": {
            "type": "substantial-envelope",
            "mainComponents": ["Hydrogen", "Helium", "Methane"]
        },
        "internalStructure": [
            "silicate-iron core",
            "supercritical fluid mantle of water, ammonia, and methane",
            "hydrogen and helium envelope"
        ]
    },
    "environment": {
        "meanTemperatureK": 76,
        "minTemperatureK": 49,
        "magneticFieldType": "global"
    },
    "discovery": {
        "discoveredBy": "William Herschel",
        "discoveryYear": 1781,
        "discoveryYearPrecision": "exact",
        "discoveryMethod": "Telescopic observation"
    }
}
